*1*. データの読み込み
- 各種CSVデータを読み込んでください
- 各種データフレーム名はsales_df、member_dfとしてください

In [2]:
import pandas as pd

sales_df = pd.read_csv('Sales_Data.csv')
member_df = pd.read_csv('Member_Data.csv')

2. 取引データの上部5行を表示してください

In [3]:
sales_df.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Amount
0,1,2024/5/1 0:00,21,25,12,3,5820
1,2,2024/5/1 2:55,107,23,17,1,640
2,3,2024/5/1 5:51,117,24,6,3,1270
3,4,2024/5/1 8:47,124,38,1,3,5980
4,5,2024/5/1 11:43,281,28,5,4,9390

3. 会員データの下部5行を表示してください

In [4]:
# LLMが回答
member_df.tail(5)

     Member_ID  Gender  Age  Days_Since_Registration
295        296    Male   41                     1513
296        297  Female   58                     1613
297        298  Female   71                     1177
298        299  Female   38                     1660
299        300  Female   50                      104

In [5]:
# 自分の回答
# member_df.head(-5)

4. 取引データの各カラムの件数や型を確認してください

In [6]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   int64
 1   Transaction_Date  1000 non-null   object
 2   Member_ID         1000 non-null   int64
 3   Product_ID        1000 non-null   int64
 4   Store_ID          1000 non-null   int64
 5   Quantity          1000 non-null   int64
 6   Amount            1000 non-null   int64
dtypes: int64(6), object(1)
memory usage: 54.8+ KB

5. 取引データの各種IDのカラムを質的変数に型変換してください。会員データに関しても同様に各種IDを質的変数に型変換してください

In [7]:
member_df.info()

# 一般的にIDは質的変数に変換したほうがいい。
# おそらく、数字の順や大きさにはあまり意味がなく、特定できればいいので、質的変数に変換する。

# sales_dfとmember_dfは、Menber_IDをキーにして結合することができる。これはよくあるらしい。

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Member_ID                300 non-null    int64
 1   Gender                   300 non-null    object
 2   Age                      300 non-null    int64
 3   Days_Since_Registration  300 non-null    int64
dtypes: int64(3), object(1)
memory usage: 9.5+ KB

In [8]:
# LLMが回答
# Convert ID columns in sales_df to categorical type
sales_df['Transaction_ID'] = sales_df['Transaction_ID'].astype('category')
sales_df['Member_ID'] = sales_df['Member_ID'].astype('category')
sales_df['Product_ID'] = sales_df['Product_ID'].astype('category')
sales_df['Store_ID'] = sales_df['Store_ID'].astype('category')

# Convert ID columns in member_df to categorical type
member_df['Member_ID'] = member_df['Member_ID'].astype('category')


# 解答例では、IDをastype("string")としている

In [9]:
sales_df.info(), member_df.info() # Check if the conversion was successful

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   category
 1   Transaction_Date  1000 non-null   object
 2   Member_ID         1000 non-null   category
 3   Product_ID        1000 non-null   category
 4   Store_ID          1000 non-null   category
 5   Quantity          1000 non-null   int64
 6   Amount            1000 non-null   int64
dtypes: category(4), int64(2), object(1)
memory usage: 83.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Member_ID                300 non-null    category
 1   Gender                   300 non-null    object
 2   Age                      300 non-null    int64
 3   Days_Since_Registration  300 non-null    int64
dtypes: category(1), int64(2), object(1)
memory usage: 18.2+ KB

(None, None)

In [10]:
# member_df['Days_Since_Registration']

6. 日付データをdatetime型に変換してください

In [11]:
sales_df['Transaction_Date'] = pd.to_datetime(sales_df['Transaction_Date'])

7. 取引データの各列の基本的な統計情報（平均、標準偏差など）を表示してください

In [12]:
sales_df.describe()

                    Transaction_Date     Quantity        Amount
count                           1000  1000.000000   1000.000000
mean   2024-06-30 23:59:30.299999744     2.551000   5338.650000
min              2024-05-01 00:00:00     1.000000    510.000000
25%              2024-05-31 11:59:15     2.000000   3022.500000
50%              2024-06-30 23:59:30     3.000000   5250.000000
75%              2024-07-31 11:59:45     4.000000   7752.500000
max              2024-08-31 00:00:00     4.000000  10000.000000
std                              NaN     1.103003   2778.234487

8. カラム名の変更
- データフレームのAmountのカラム名をSales_Amountに変更してください
- データフレームは上書きしないでください

In [13]:
# LLMが回答
sales_df_llm_work = sales_df.rename(columns={'Amount': 'Sales_Amount'})

In [14]:
# 自分で調べた方法
sales_df_my_work = sales_df.copy()
# sales_df['Amount']
sales_df_my_work.columns = ['Transaction_ID', 'Transaction_Date', 'Member_ID', 'Product_ID',
       'Store_ID', 'Quantity', 'Sales_Amount']
sales_df_my_work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   category
 1   Transaction_Date  1000 non-null   datetime64[ns]
 2   Member_ID         1000 non-null   category
 3   Product_ID        1000 non-null   category
 4   Store_ID          1000 non-null   category
 5   Quantity          1000 non-null   int64
 6   Sales_Amount      1000 non-null   int64
dtypes: category(4), datetime64[ns](1), int64(2)
memory usage: 83.0 KB

In [15]:
# 二つのやり方を比較
sales_df_llm_work.head()
# print("="*20)
sales_df_my_work.head()

# 両方同じ結果が出たので、どちらでも良い

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5820
1,2,2024-05-01 02:55:00,107,23,17,1,640
2,3,2024-05-01 05:51:00,117,24,6,3,1270
3,4,2024-05-01 08:47:00,124,38,1,3,5980
4,5,2024-05-01 11:43:00,281,28,5,4,9390

9. Amountを100円単位に四捨五入して表示してください

In [16]:
# 自分で調べた方法
sales_df_my_work['Sales_Amount'] = sales_df_my_work['Sales_Amount'].round(-2) # Round to the nearest 100
sales_df_my_work.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

In [17]:
# LLMが回答(同じ結果になった)
sales_df_llm_work['Sales_Amount'] = sales_df_llm_work['Sales_Amount'].round(-2)  # Round to the nearest 100
sales_df_llm_work.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

10. 取引データからAmountが5000円を超える取引を抽出してください

In [18]:
sales_df_my_work[sales_df_my_work['Sales_Amount'] > 5000].head()

# 解答例
sales_df_my_work.query('Sales_Amount > 5000').head()
# 汎用的に使える。よく使う。クエリの中に条件分を入れる。

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400
5,6,2024-05-01 14:39:00,292,21,14,4,8700
6,7,2024-05-01 17:35:00,203,43,5,3,9800

11. 会員データから30歳から50歳の会員を抽出してください

In [19]:
# 自分の回答
# member_df[30 <= member_df['Age'] <= 50].head() # この書き方はエラーになる。条件式は分ける必要がある。

# 自分で調べた方法
# filtered_df = member_df.query('30 <= Age <= 50')
# print(filtered_df) # 同じ結果になる
filtered_df = member_df.loc[(member_df['Age'] >= 30) & (member_df['Age'] <= 50)]
print(filtered_df)

    Member_ID  Gender  Age  Days_Since_Registration
3           4  Female   49                     1881
8           9    Male   48                     1640
9          10  Female   48                     1317
12         13    Male   41                     1855
13         14    Male   33                      928
..        ...     ...  ...                      ...
292       293  Female   35                      388
293       294    Male   32                     1127
295       296    Male   41                     1513
298       299  Female   38                     1660
299       300  Female   50                      104

[114 rows x 4 columns]

In [20]:
# LLMが回答
member_df[(member_df['Age'] >= 30) & (member_df['Age'] <= 50)]

    Member_ID  Gender  Age  Days_Since_Registration
3           4  Female   49                     1881
8           9    Male   48                     1640
9          10  Female   48                     1317
12         13    Male   41                     1855
13         14    Male   33                      928
..        ...     ...  ...                      ...
292       293  Female   35                      388
293       294    Male   32                     1127
295       296    Male   41                     1513
298       299  Female   38                     1660
299       300  Female   50                      104

[114 rows x 4 columns]

12. 取引データから"2024-08-01"以降に行われた取引を抽出してください

In [21]:
# 自分の回答
sales_df_my_work[sales_df_my_work['Transaction_Date'] > '2024-08-01']

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [22]:
# LLMの回答
sales_df_llm_work[sales_df_llm_work['Transaction_Date'] >= '2024-08-01'] # >=以外は自分の回答と同じ

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [23]:
# 解答例
sales_df_my_work.query("Transaction_Date >= '2024-08-01'")

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

13. Store_ID が「1」または「3」で、かつ Amount が5000円以上の取引を抽出してください

In [24]:
# sales_df_my_work['Store_ID'].nunique()
# sales_df_my_work[(sales_df_my_work['Store_ID'] == 1) | (sales_df_my_work['Store_ID'] == 3) & (sales_df_my_work['Sales_Amount'] >= 5000)]

# 上記のやり方だと、1or3の条件が先に評価されてしまうので、括弧で囲む必要がある。(動きを見ると、&は3にしかかかっていない)
# sales_df_my_work[((sales_df_my_work['Store_ID'] == 1) | (sales_df_my_work['Store_ID'] == 3)) & (sales_df_my_work['Sales_Amount'] >= 5000)]
# また、queryを使うと、括弧を使わなくても、条件を指定できる。
sales_df_my_work.query("(Store_ID == 1 or Store_ID == 3) and Sales_Amount >= 5000")

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
3,4,2024-05-01 08:47:00,124,38,1,3,6000
7,8,2024-05-01 20:30:00,51,18,1,4,5500
17,18,2024-05-03 01:49:00,156,3,1,3,7600
61,62,2024-05-08 10:47:00,50,38,3,4,6500
65,66,2024-05-08 22:30:00,60,49,3,2,5800
86,87,2024-05-11 12:03:00,77,37,1,2,8500
95,96,2024-05-12 14:26:00,167,9,1,3,5400
109,110,2024-05-14 07:28:00,229,49,3,4,9800
129,130,2024-05-16 18:05:00,259,1,1,2,9500
138,139,2024-05-17 20:28:00,116,17,3,1,9800
151,152,2024-05-19 10:34:00,136,17,3,1,8200
188,189,2024-05-23 23:00:00,12,11,1,2,9900
189,190,2024-05-24 01:56:00,239,50,3,3,8000
202,203,2024-05-25 16:02:00,73,9,3,2,6100
210,211,2024-05-26 15:29:00,25,8,1,4,9400
279,280,2024-06-04 01:43:00,133,3,1,4,8200
280,281,2024-06-04 04:39:00,183,14,1,1,5600
287,288,2024-06-05 01:10:00,138,38,1,2,8200
305,306,2024-06-07 05:56:00,52,8,3,2,9400
309,310,2024-06-07 17:39:00,232,29,1,1,8300
313,314,2024-06-08 05:22:00,42,17,3,1,7300
318,319,2024-06-08 20:02:00,192,19,1,3,7400
360,361,2024-06-13 23:08:00,261,26,3,3,6200
392,393,2024-06-17 20:55:00,273,48,3,3,6900
441,442,2024-06-23 20:32:00,118,7,1,4,7000
443,444,2024-06-24 02:24:00,23,13,1,2,9300
446,447,2024-06-24 11:11:00,108,13,3,4,7800
483,484,2024-06-28 23:38:00,111,49,3,1,6800
491,492,2024-06-29 23:05:00,202,38,3,4,8000
492,493,2024-06-30 02:01:00,38,24,3,2,8100
547,548,2024-07-06 19:13:00,90,11,1,3,7800
554,555,2024-07-07 15:44:00,254,22,3,1,8700
615,616,2024-07-15 02:31:00,165,50,3,1,5600
643,644,2024-07-18 12:35:00,2,29,3,2,8600
647,648,2024-07-19 00:18:00,66,43,1,2,8600
701,702,2024-07-25 14:34:00,47,24,3,2,7600
710,711,2024-07-26 16:57:00,114,36,3,4,9700
732,733,2024-07-29 09:26:00,162,10,1,1,8100
775,776,2024-08-03 15:28:00,289,17,3,1,6000
782,783,2024-08-04 11:59:00,201,5,1,1,8300
788,789,2024-08-05 05:34:00,191,19,1,3,8100
797,798,2024-08-06 07:57:00,142,14,1,4,5800
808,809,2024-08-07 16:11:00,46,48,3,4,5100
837,838,2024-08-11 05:11:00,164,23,3,2,9300
845,846,2024-08-12 04:38:00,222,40,1,4,8800
860,861,2024-08-14 00:36:00,158,41,3,3,6600
867,868,2024-08-14 21:07:00,149,25,3,1,8100
873,874,2024-08-15 14:42:00,65,36,3,3,9000
885,886,2024-08-17 01:52:00,276,32,1,3,5800
891,892,2024-08-17 19:27:00,76,10,1,1,6700
946,947,2024-08-24 12:39:00,72,43,1,2,7600
947,948,2024-08-24 15:35:00,109,35,1,1,9100
953,954,2024-08-25 09:10:00,8,4,3,2,7300
968,969,2024-08-27 05:08:00,225,13,3,2,6800

14. Product_ID が「10」、「20」、「30」のいずれかに一致する取引を抽出してください

In [25]:
# 自分の回答
# sales_df_my_work[sales_df_my_work['Product_ID'] in ['10', '20', '30']] # この書き方はエラーになる。inの使い方が間違っている。

# 自分で調べた方法
sales_df_my_work[sales_df_my_work['Product_ID'].isin([10, 20, 30])].head()
# sales_df_my_work.query("Product_ID in [10, 20, 30]").head() # 上記と同じ結果になる

# '10'ではなく、10という部分も間違っていたので、修正

# 解答例
sales_df_my_work.query("Product_ID in [10, 20, 30]").head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
13,14,2024-05-02 14:06:00,52,30,2,1,8600
41,42,2024-05-06 00:10:00,47,20,12,1,3100
44,45,2024-05-06 08:57:00,277,10,10,4,6900
69,70,2024-05-09 10:14:00,164,30,9,3,4600
84,85,2024-05-11 06:11:00,138,30,2,3,1800

In [26]:
# LLMの回答
sales_df_llm_work[sales_df_llm_work['Product_ID'].isin([10, 20, 30])].head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
13,14,2024-05-02 14:06:00,52,30,2,1,8600
41,42,2024-05-06 00:10:00,47,20,12,1,3100
44,45,2024-05-06 08:57:00,277,10,10,4,6900
69,70,2024-05-09 10:14:00,164,30,9,3,4600
84,85,2024-05-11 06:11:00,138,30,2,3,1800

In [27]:
# type(sales_df_my_work['Product_ID'][0])
# sales_df_my_work.info()
# sales_df_my_work['Product_ID'] = sales_df_my_work['Product_ID'].astype(int)

# sales_df_my_work['Product_ID'].dtype # categories_dtype=int64
# sales_df_my_work['Quantity'].dtype # dtype('int64')

15. Product_ID が「10」、「20」、「30」ではない取引を抽出してください

In [28]:
# 自分で調べた方法
sales_df_my_work[~sales_df_my_work['Product_ID'].isin([10, 20, 30])].head()
# sales_df_my_work.query("Product_ID not in [10, 20, 30]").head() # 上記と同じ結果になる

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

16. Quantity が最頻値で、かつ Store_ID が「3」の取引を抽出してください

In [29]:
# 自分で調べた方法
# sales_df_my_work['Quantity'].nunique()
# sales_df_my_work['Quantity'].value_counts()
# sales_df_my_work['Quantity'].mode()[0] # 4が最も多い

# [0]とiloc[0]は同じだが可読性向上する

# Quantityの最頻値を求める
mode_quantity = sales_df_my_work['Quantity'].mode().iloc[0]
# 条件に合うデータを抽出
filtered_df = sales_df_my_work[(sales_df_my_work['Quantity'] == mode_quantity) & (sales_df_my_work['Store_ID'] == 3)]
# 結果を表示
print(filtered_df)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
43              44 2024-05-06 06:01:00       118         29        3
61              62 2024-05-08 10:47:00        50         38        3
109            110 2024-05-14 07:28:00       229         49        3
383            384 2024-06-16 18:32:00       269         44        3
446            447 2024-06-24 11:11:00       108         13        3
472            473 2024-06-27 15:23:00        14         44        3
491            492 2024-06-29 23:05:00       202         38        3
710            711 2024-07-26 16:57:00       114         36        3
808            809 2024-08-07 16:11:00        46         48        3
908            909 2024-08-19 21:17:00        93          2        3

     Quantity  Sales_Amount
43          4          4800
61          4          6500
109         4          9800
383         4          4300
446         4          7800
472         4          3500
491         4          8000
710         4          9700
808         4          5100
908         4          2100

In [30]:
# LLMの回答
# Calculate the mode of the Quantity column
quantity_mode = sales_df_llm_work['Quantity'].mode()[0]

# Filter transactions where Quantity is the mode and Store_ID is 3
filtered_transactions = sales_df_llm_work[(sales_df_my_work['Quantity'] == quantity_mode) & (sales_df_llm_work['Store_ID'] == 3)]
print(filtered_transactions)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
43              44 2024-05-06 06:01:00       118         29        3
61              62 2024-05-08 10:47:00        50         38        3
109            110 2024-05-14 07:28:00       229         49        3
383            384 2024-06-16 18:32:00       269         44        3
446            447 2024-06-24 11:11:00       108         13        3
472            473 2024-06-27 15:23:00        14         44        3
491            492 2024-06-29 23:05:00       202         38        3
710            711 2024-07-26 16:57:00       114         36        3
808            809 2024-08-07 16:11:00        46         48        3
908            909 2024-08-19 21:17:00        93          2        3

     Quantity  Sales_Amount
43          4          4800
61          4          6500
109         4          9800
383         4          4300
446         4          7800
472         4          3500
491         4          8000
710         4          9700
808         4          5100
908         4          2100

In [31]:
# 解答例
quantity_mode = sales_df_llm_work['Quantity'].mode()[0]
sales_df_my_work.query("Quantity == @quantity_mode and Store_ID == 3") # @をつけることで、変数を使うことができる

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
43,44,2024-05-06 06:01:00,118,29,3,4,4800
61,62,2024-05-08 10:47:00,50,38,3,4,6500
109,110,2024-05-14 07:28:00,229,49,3,4,9800
383,384,2024-06-16 18:32:00,269,44,3,4,4300
446,447,2024-06-24 11:11:00,108,13,3,4,7800
472,473,2024-06-27 15:23:00,14,44,3,4,3500
491,492,2024-06-29 23:05:00,202,38,3,4,8000
710,711,2024-07-26 16:57:00,114,36,3,4,9700
808,809,2024-08-07 16:11:00,46,48,3,4,5100
908,909,2024-08-19 21:17:00,93,2,3,4,2100

17. Amount が第1四分位から第3四分位の範囲に属する取引を抽出してください

In [32]:
# 自分で調べた方法
# sales_df_my_work['Sales_Amount'].describe()
q1 = sales_df_my_work['Sales_Amount'].quantile(0.25)
q3 = sales_df_my_work['Sales_Amount'].quantile(0.75)

sales_df_my_work[(sales_df_my_work['Sales_Amount'] >= q1) & (sales_df_my_work['Sales_Amount'] <= q3)].head()

# 解答例
q1 = sales_df_my_work['Sales_Amount'].quantile(0.25)
q3 = sales_df_my_work['Sales_Amount'].quantile(0.75)
sales_df_my_work.query("@q1 <= Sales_Amount <= @q3").head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
3,4,2024-05-01 08:47:00,124,38,1,3,6000
7,8,2024-05-01 20:30:00,51,18,1,4,5500
10,11,2024-05-02 05:18:00,141,45,9,4,6700
11,12,2024-05-02 08:14:00,275,9,19,4,3700

18. Product_IDとStore_IDは何種類あるか確認してください

In [33]:
sales_df_my_work['Product_ID'].nunique(), sales_df_my_work['Store_ID'].nunique()

(50, 20)

19. 取引データのProduct_ID ごとに Amount の合計を計算してください

In [34]:
sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum() # LLMで修正
# sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum().nunique()
# sales_df_my_work.groupby('Product_ID')['Sales_Amount'].nunique()

# メモ
# グループ化: df.groupby('column_name')は、指定された列('column_name')の値に基づいてデータをグループ化します。
# 集計: その後、集計関数（例：sum(), mean(), count()など）を適用して、各グループごとに計算を行います。
# 例：result = df.groupby('category')['value'].sum()
# 'category'列の値でデータをグループ化
# 各グループ内の'value'列の合計を計算

Product_ID
1     121600
2      49800
3     110300
4     122600
5      76700
6      84700
7      94200
8     135900
9      72600
10     92100
11    138700
12     63900
13    139300
14     70300
15     68100
16    106200
17    169400
18    109900
19    130500
20     83700
21    111700
22    128400
23    106500
24    114100
25     88800
26    101600
27    102600
28    121200
29    126000
30     85300
31    106100
32    124900
33     58300
34    126300
35    123200
36    172300
37    126400
38    130800
39     77300
40    110600
41    110600
42     77400
43    101800
44     97100
45    148600
46     55500
47    156200
48     78100
49    118700
50    111200
Name: Sales_Amount, dtype: int64

20. Product_ID ごとにQuantityの中央値を計算してください

In [35]:
sales_df_my_work.groupby('Product_ID')['Quantity'].median()

Product_ID
1     2.0
2     2.0
3     3.0
4     2.0
5     3.0
6     3.0
7     2.0
8     2.0
9     3.0
10    3.0
11    3.0
12    3.0
13    2.0
14    3.0
15    2.5
16    3.0
17    2.0
18    3.0
19    2.0
20    3.0
21    2.5
22    3.0
23    2.0
24    2.0
25    3.0
26    2.0
27    2.0
28    3.0
29    3.0
30    3.0
31    3.0
32    3.0
33    3.0
34    3.0
35    3.0
36    3.0
37    3.0
38    3.0
39    3.0
40    2.0
41    2.0
42    3.0
43    2.0
44    2.5
45    3.0
46    2.0
47    2.0
48    2.5
49    3.0
50    2.0
Name: Quantity, dtype: float64

In [36]:
# LLMが回答
sales_df_llm_work.groupby('Product_ID')['Quantity'].median()

Product_ID
1     2.0
2     2.0
3     3.0
4     2.0
5     3.0
6     3.0
7     2.0
8     2.0
9     3.0
10    3.0
11    3.0
12    3.0
13    2.0
14    3.0
15    2.5
16    3.0
17    2.0
18    3.0
19    2.0
20    3.0
21    2.5
22    3.0
23    2.0
24    2.0
25    3.0
26    2.0
27    2.0
28    3.0
29    3.0
30    3.0
31    3.0
32    3.0
33    3.0
34    3.0
35    3.0
36    3.0
37    3.0
38    3.0
39    3.0
40    2.0
41    2.0
42    3.0
43    2.0
44    2.5
45    3.0
46    2.0
47    2.0
48    2.5
49    3.0
50    2.0
Name: Quantity, dtype: float64

21. Store_ID ごとに平均Amountを集計してください

In [37]:
sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean()

# sales_df_my_work.groupby('Store_ID')：データフレームをStore_IDでグループ化します。
# ['Amount'].mean()：各グループ（つまり各Store_ID）のAmount列の平均値を計算します。
# 結果はstore_avg_amountというSeriesに格納されます。
# このSeriesのインデックスはStore_IDで、値はそれぞれのStore_IDに対応するAmountの平均になります。

# 結果をより見やすくする
# store_avg_amount_df = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean().reset_index()
# store_avg_amount_df.columns = ['Store_ID', 'Average_Amount']
# print(store_avg_amount_df)

Store_ID
1     5873.333333
2     4630.952381
3     5507.843137
4     5329.268293
5     5686.363636
6     5361.111111
7     5458.974359
8     5436.065574
9     5619.047619
10    5301.923077
11    4868.000000
12    5602.272727
13    5815.254237
14    5873.333333
15    5585.937500
16    5201.960784
17    4727.536232
18    4885.416667
19    5091.489362
20    5075.000000
Name: Sales_Amount, dtype: float64

22. 会員データの性別 (Gender) ごとに平均年齢を計算してください

In [38]:
member_df.groupby("Gender")["Age"].mean()

Gender
Female    48.945205
Male      53.259740
Name: Age, dtype: float64

23. 会員ごとに平均 Amount を計算してください

In [39]:
# member_df.groupby('Member_ID')['Amount'].mean()
# member_df.info()
# member_df.columns
sales_df_my_work.columns

# 解答例
sales_df_my_work.groupby('Member_ID')['Sales_Amount'].mean()

Member_ID
1      5000.000000
2      5900.000000
3      5100.000000
4      2600.000000
5      4525.000000
          ...
295    7833.333333
296    9400.000000
297    5450.000000
298    9400.000000
300    5900.000000
Name: Sales_Amount, Length: 288, dtype: float64

In [40]:
# LLMが回答
average_amount_per_member = sales_df_my_work.groupby('Member_ID')['Sales_Amount'].mean()
print(average_amount_per_member)

Member_ID
1      5000.000000
2      5900.000000
3      5100.000000
4      2600.000000
5      4525.000000
          ...
295    7833.333333
296    9400.000000
297    5450.000000
298    9400.000000
300    5900.000000
Name: Sales_Amount, Length: 288, dtype: float64

24. Transaction_Dateから日付だけ取り出して日付ごとに Amount の合計を集計してください

In [41]:
OnlyDate = sales_df_my_work['Transaction_Date'].dt.date
# OnlyDate.head()
# sales_df_my_work['Transaction_Date'].head()

sum_amount_per_date = sales_df_my_work.groupby(sales_df_my_work['Transaction_Date'].dt.date)['Sales_Amount'].sum()
print(sum_amount_per_date)

Transaction_Date
2024-05-01    55100
2024-05-02    47800
2024-05-03    52000
2024-05-04    38800
2024-05-05    47400
              ...
2024-08-27    42500
2024-08-28    34300
2024-08-29    42800
2024-08-30    44100
2024-08-31     7500
Name: Sales_Amount, Length: 123, dtype: int64

In [42]:
# 解答例
sales_df_my_work['Transaction_Date_yyyyMMdd'] = sales_df_my_work['Transaction_Date'].dt.date
sales_df_my_work.groupby('Transaction_Date_yyyyMMdd')['Sales_Amount'].sum()

Transaction_Date_yyyyMMdd
2024-05-01    55100
2024-05-02    47800
2024-05-03    52000
2024-05-04    38800
2024-05-05    47400
              ...
2024-08-27    42500
2024-08-28    34300
2024-08-29    42800
2024-08-30    44100
2024-08-31     7500
Name: Sales_Amount, Length: 123, dtype: int64

25. 日付ごとに合計のAmountを集計し、合計Amountが小さい順にソートしてください

In [43]:
# Transaction_Date_yyyyMMddがindexになってしまっていたので、reset_indexでindexを振り直す
# というのも、groupbyでindexが消えてしまうから(それごとにまとめるので)
# ただ、今回はcolumnにあったほうが見やすいので、reset_indexを使っている
# reset_indexはデータの構造を綺麗にするためによく使う
sales_df_my_work.groupby('Transaction_Date_yyyyMMdd')['Sales_Amount'].sum().reset_index().sort_values(by='Sales_Amount', ascending=True)
# assending ... 昇順:True, 降順:False

    Transaction_Date_yyyyMMdd  Sales_Amount
122                2024-08-31          7500
51                 2024-06-21         24100
20                 2024-05-21         25200
114                2024-08-23         28200
68                 2024-07-08         28900
..                        ...           ...
39                 2024-06-09         57400
24                 2024-05-25         57600
117                2024-08-26         59800
84                 2024-07-24         60600
67                 2024-07-07         66100

[123 rows x 2 columns]

26. 月ごとに Amount を集計してください

In [44]:
OnlyMonth = sales_df_my_work['Transaction_Date'].dt.month
# OnlyMonth.tail()

sum_amount_per_month = sales_df_my_work.groupby(sales_df_my_work['Transaction_Date'].dt.month)['Sales_Amount'].sum()
print(sum_amount_per_month)

Transaction_Date
5    1374500
6    1282200
7    1355700
8    1325700
Name: Sales_Amount, dtype: int64

In [45]:
# 解答例
sales_df_my_work['Month'] = sales_df_my_work['Transaction_Date'].dt.to_period('M')
sales_df_my_work.groupby('Month')['Sales_Amount'].sum()

Month
2024-05    1374500
2024-06    1282200
2024-07    1355700
2024-08    1325700
Freq: M, Name: Sales_Amount, dtype: int64

In [46]:
# import pandas as pd

# # サンプルデータの作成
# data = {'date': ['2023-01-01', '2023-02-15', '2023-03-20']}
# df = pd.DataFrame(data)

# # 'date'列をdatetime型に変換
# df['date'] = pd.to_datetime(df['date'])

# # 'date'列を月単位の期間に変換
# df['period'] = df['date'].dt.to_period('M')

# print(df)

27. 月ごとのAmountの増減の絶対値を前月と比較して計算してください

In [47]:
# LLMが回答
# Calculate the absolute difference in Sales_Amount between each month
monthly_diff = sum_amount_per_month.diff().abs()

# Drop the first NaN value resulting from the diff() operation
monthly_diff = monthly_diff.dropna()

print(monthly_diff)

Transaction_Date
6    92300.0
7    73500.0
8    30000.0
Name: Sales_Amount, dtype: float64

In [48]:
# 解答例
monthly_sales = sales_df_my_work.groupby('Month')['Sales_Amount'].sum().reset_index()
monthly_sales['Sales_Amount'].diff().abs()

0        NaN
1    92300.0
2    73500.0
3    30000.0
Name: Sales_Amount, dtype: float64

28. 曜日ごとの合計Amountを集計してください

In [49]:
# sales_df_my_work['Transaction_Date'].dt.weekday
DayName = sales_df_my_work['Transaction_Date'].dt.day_name()
sales_df_my_work.groupby(DayName)['Sales_Amount'].sum()

Transaction_Date
Friday       745700
Monday       718500
Saturday     752300
Sunday       765100
Thursday     791900
Tuesday      722500
Wednesday    842100
Name: Sales_Amount, dtype: int64

In [50]:
# 解答例
sales_df_my_work['Day_of_Week'] = sales_df_my_work['Transaction_Date'].dt.day_name()
sales_df_my_work.groupby('Day_of_Week')['Sales_Amount'].sum()

Day_of_Week
Friday       745700
Monday       718500
Saturday     752300
Sunday       765100
Thursday     791900
Tuesday      722500
Wednesday    842100
Name: Sales_Amount, dtype: int64

In [51]:
# 解答例では、カラムにどんどん新しく追加しているが、この方が、ある意味新しい特徴量を増やせていいのかも？
sales_df_my_work.info()

# groupbyについてメモ
# 特徴量エンジニアリング
# 	•	データ分析では、新しい特徴量を作成するために`groupby`が頻繁に使用されます。
# 	•	例: 各顧客の購入回数や平均購入金額を算出し、それを新しい列として追加する。
# 	•	このような操作は、機械学習モデルの性能向上に寄与する特徴量エンジニアリングで重要な役割を果たします。
# データ変換とフィルタリング
# 	•	グループごとに特定の処理（例えば正規化やフィルタリング）を適用することも可能です。
# 	•	例: 各グループ内で値を標準化したり、条件に基づいてデータを抽出したりする。
# まとめ
# Pythonの`groupby`関数は、データ分析や機械学習で非常に重要なツールです。特に「集計」「特徴量作成」「データ変換」の場面で活用され、新しい洞察を得るための基盤となります。

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Transaction_ID             1000 non-null   category
 1   Transaction_Date           1000 non-null   datetime64[ns]
 2   Member_ID                  1000 non-null   category
 3   Product_ID                 1000 non-null   category
 4   Store_ID                   1000 non-null   category
 5   Quantity                   1000 non-null   int64
 6   Sales_Amount               1000 non-null   int64
 7   Transaction_Date_yyyyMMdd  1000 non-null   object
 8   Month                      1000 non-null   period[M]
 9   Day_of_Week                1000 non-null   object
dtypes: category(4), datetime64[ns](1), int64(2), object(2), period[M](1)
memory usage: 106.5+ KB

29. 1週間ごとに合計Amountを集計してください

In [52]:
# weekdayだと各曜日が数値に変換されて、曜日ごと集計される(0:月、1:火、2:水...)
WeekDay = sales_df_my_work['Transaction_Date'].dt.weekday
print(WeekDay.unique(), WeekDay.nunique())
sales_df_my_work.groupby(WeekDay)['Sales_Amount'].sum()

[2 3 4 5 6 0 1] 7

Transaction_Date
0    718500
1    722500
2    842100
3    791900
4    745700
5    752300
6    765100
Name: Sales_Amount, dtype: int64

In [53]:
# 解答例
sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.to_period('W')
# sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.weekday
sales_df_my_work.groupby('Week')['Sales_Amount'].sum()

Week
2024-04-29/2024-05-05    241100
2024-05-06/2024-05-12    311300
2024-05-13/2024-05-19    304900
2024-05-20/2024-05-26    309600
2024-05-27/2024-06-02    290600
2024-06-03/2024-06-09    312800
2024-06-10/2024-06-16    300100
2024-06-17/2024-06-23    281900
2024-06-24/2024-06-30    304400
2024-07-01/2024-07-07    319800
2024-07-08/2024-07-14    287600
2024-07-15/2024-07-21    309900
2024-07-22/2024-07-28    287500
2024-07-29/2024-08-04    316200
2024-08-05/2024-08-11    278900
2024-08-12/2024-08-18    343900
2024-08-19/2024-08-25    306600
2024-08-26/2024-09-01    231000
Freq: W-SUN, Name: Sales_Amount, dtype: int64

以下の2つのコードの違いを説明します。

```python
sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.to_period('W')
sales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.weekday
```

### **1. `to_period('W')` の場合**
- **機能**: `to_period('W')` は、`Transaction_Date` を週単位の期間（`Period`型）に変換します。この場合、各日付が属する週を表します。
- **結果**: 各日付が「その週の開始日から終了日まで」を表す形式に変換されます（例: `2025-02-17/2025-02-23`）。週の終了日はデフォルトで日曜日です[1][4]。
- **用途**: データを「週単位」で集計したい場合に便利です。

**例**:
```python
# 2025年2月19日は、2025年2月17日（月）～2025年2月23日（日）の週に属する
2025-02-19 -> 2025-02-17/2025-02-23
```

---

### **2. `.weekday` の場合**
- **機能**: `.weekday` は、`Transaction_Date` の曜日を数値（整数）として取得します。月曜日が `0`、日曜日が `6` です[2][3]。
- **結果**: 各日付がその曜日に対応する数値に変換されます。
- **用途**: 曜日の情報を使いたい場合や、特定の曜日でフィルタリングしたい場合に使用します。

**例**:
```python
# 2025年2月19日は水曜日なので、数値としては 2 が返される
2025-02-19 -> 2
```

---

### **主な違い**
| 特徴                     | `to_period('W')`                          | `.weekday`            |
|--------------------------|-------------------------------------------|-----------------------|
| **目的**                 | 週単位の期間を取得                        | 曜日を数値で取得       |
| **出力形式**             | `Period` 型（例: `2025-02-17/2025-02-23`） | 整数（例: `0~6`）      |
| **用途**                 | 週単位での集計やグループ化                  | 曜日の分析や条件分岐    |
| **データ型**             | `Period[W-SUN]`                          | `int64`               |

### **まとめ**
- 週単位でデータを扱いたい場合は `to_period('W')` を使用。
- 曜日に基づく分析や条件分岐が必要な場合は `.weekday` を使用。

30. 1週間ごとのAmountの増減を計算し、増加率をパーセンテージで表示してください

In [54]:
sum_amount_per_week = sales_df_my_work.groupby(WeekDay)['Sales_Amount'].sum()
diff_amount_per_week = sum_amount_per_week.diff().abs()
diff_amount_per_week = diff_amount_per_week.dropna()
print(diff_amount_per_week)

# 増減率はわからなかったので、調べてみる
# 増減率 = (後の値 - 前の値) / 前の値

sum_amount_per_week.reset_index().diff().abs()

sum_amount_per_week.reset_index().pct_change()*100

Transaction_Date
1      4000.0
2    119600.0
3     50200.0
4     46200.0
5      6600.0
6     12800.0
Name: Sales_Amount, dtype: float64

   Transaction_Date  Sales_Amount
0               NaN           NaN
1               inf      0.556715
2        100.000000     16.553633
3         50.000000     -5.961287
4         33.333333     -5.834070
5         25.000000      0.885074
6         20.000000      1.701449

In [55]:
# LLMが回答
# Calculate the week-over-week percentage change in Sales_Amount
percentage_change_per_week = sum_amount_per_week.pct_change().dropna() * 100

# Display the result
print(percentage_change_per_week)

Transaction_Date
1     0.556715
2    16.553633
3    -5.961287
4    -5.834070
5     0.885074
6     1.701449
Name: Sales_Amount, dtype: float64

In [56]:
# 解答例
# (上でsales_df_my_work['Week'] = sales_df_my_work['Transaction_Date'].dt.to_period('W')をしているので、Weekが使える)
weekly_sales = sales_df_my_work.groupby('Week')['Sales_Amount'].sum().reset_index() # weekがindexになっているので、reset_indexを使って、indexを振り直す
weekly_sales['Sales_Amount'].pct_change()*100 # 前のサンプルとの差分の増加率が%で表示されている

0           NaN
1     29.116549
2     -2.055895
3      1.541489
4     -6.136951
5      7.639367
6     -4.060102
7     -6.064645
8      7.981554
9      5.059133
10   -10.068793
11     7.753825
12    -7.228138
13     9.982609
14   -11.796331
15    23.305844
16   -10.846176
17   -24.657534
Name: Sales_Amount, dtype: float64

### pct_change()の意味
```python
weekly_sales['Sales_Amount'].pct_change() * 100
```

#### `.pct_change()`
- Pandasの`pct_change()`メソッドは、**「前の行との相対的な変化率」** を計算します。
- 具体的には、以下の式で計算されます：
  $$
  \text{変化率} = \frac{\text{現在の値} - \text{前の値}}{\text{前の値}}
  $$
#### コード適用後
```python
weekly_sales['Sales_Amount'].pct_change() * 100
```

結果：
| Week | Sales_Amount | pct_change (%) |
|------|--------------|----------------|
|   1  |          200 | NaN            |
|   2  |          250 | (250-200)/200 *100 = **25.0** |
|   3  |          300 | (300-250)/250 *100 = **20.0** |
|   4  |          240 | (240-300)/300 *100 = **-20.0** |

---

### 注意点
1. **最初の行は常に`NaN`になる**  
   最初の行には比較する「前の値」が存在しないため、結果は`NaN`になります。

2. **ゼロ除算に注意**  
   前の値がゼロの場合、ゼロ除算エラーが発生する可能性があります。この場合、結果は`inf`やエラーになることがあります。

3. **目的**  
   このコードは、週ごとの売上金額（`Sales_Amount`）がどれだけ増減したかをパーセンテージで把握するために使われます。売上トレンドや成長率を分析する際に役立ちます。

---

### 応用例
もし、この結果を新しい列としてデータフレームに追加したい場合は、以下のように書けます：
```python
weekly_sales['Sales_Change_Percentage'] = weekly_sales['Sales_Amount'].pct_change() * 100
```

これによって、元データフレームに新しい列として変化率が追加されます。

31. 新しく作成したカラムを削除してください

In [57]:
# sales_df_my_work.columns
# 列方向から新しく作成したカラムを削除する
sales_df_my_work.drop(columns=['Transaction_Date_yyyyMMdd', 'Month', 'Day_of_Week', 'Week'], axis=1, inplace=True)

sales_df_my_work

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [58]:
# 新しく作成したカラムを削除
# sales_df_my_work = sales_df_my_work.drop(columns=['OnlyDate', 'OnlyMonth', 'WeekDay']) # カラムには追加していないので必要ない？

32. Amount が1000円を超える取引を抽出し、Store_ID と Product_ID ごとに Amount の合計を計算してください

In [59]:
# # amount_over_1000 = sales_df_my_work[sales_df_my_work['Sales_Amount'] > 1000].head() # ここでheadをしてしまっているので、データが5行のみになってしまっていた
# amount_over_1000 = sales_df_my_work[sales_df_my_work['Sales_Amount'] > 1000]
# # print(amount_over_1000['Store_ID'].unique())
# amount_over_1000.groupby('Store_ID')['Sales_Amount'].sum()

# # 複数のラベルでグループ化する方法はわからなかったので、調べてみる
# # amount_over_1000.groupby(['Store_ID', 'Product_ID'])['Sales_Amount'].sum()
# # sales_df_my_work['Store_ID'].nunique()

In [60]:
# LLMが回答
# Extract transactions where Sales_Amount is greater than 1000
amount_over_1000 = sales_df_my_work[sales_df_my_work['Sales_Amount'] > 1000]

# Calculate the sum of Sales_Amount for each combination of Store_ID and Product_ID
sum_amount_per_store_product = amount_over_1000.groupby(['Store_ID', 'Product_ID'])['Sales_Amount'].sum()

# Display the result
print(sum_amount_per_store_product)

Store_ID  Product_ID
1         1              9500
          2                 0
          3             20300
          4              3800
          5             12500
                        ...
20        46             1100
          47             9500
          48                0
          49            15200
          50                0
Name: Sales_Amount, Length: 1000, dtype: int64

In [61]:
# 解答例
filtered_sales_df = sales_df_my_work.query("Sales_Amount > 1000")
# Keyは二つなのでリストに入れる
filtered_sales_df.groupby(["Store_ID", "Product_ID"])["Sales_Amount"].sum()

Store_ID  Product_ID
1         1              9500
          2                 0
          3             20300
          4              3800
          5             12500
                        ...
20        46             1100
          47             9500
          48                0
          49            15200
          50                0
Name: Sales_Amount, Length: 1000, dtype: int64

33. Store_ID ごとの合計Amountを集計し300000円以上の店舗を抽出してください

In [62]:
sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum()
# この時点でSales_Amountのラベルは取れてしまう ※

sum_amount_per_storeid[sum_amount_per_storeid > 300000]
# sum_amount_per_storeid.head()

# ここからはわからなかったので、調べてみる
sum_amount_per_storeid[sum_amount_per_storeid > 300000].index # Store_IDのみ取得 # これが条件になる
sales_df_my_work[sales_df_my_work['Store_ID'].isin(sum_amount_per_storeid[sum_amount_per_storeid > 300000].index)].head()




# 解答例のやり方と同じ結果になる
# ※ 2025/02/22 解説を読んだ時のメモ：reset_index()で"Sales_Amount"のラベルも復活した状態になる
sum_amount_per_storeid = sum_amount_per_storeid.reset_index()
sum_amount_per_storeid[sum_amount_per_storeid['Sales_Amount'] > 300000]

   Store_ID  Sales_Amount
7         8        331600
12       13        343100
14       15        357500
16       17        326200

In [63]:
# LLMが回答
# Calculate the sum of Sales_Amount for each Store_ID
sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum()

# Filter Store_IDs with Sales_Amount greater than 300000
store_ids_over_300k = sum_amount_per_storeid[sum_amount_per_storeid > 300000].index

# Filter the original DataFrame to include only rows with Store_IDs in store_ids_over_300k
filtered_sales_df = sales_df_my_work[sales_df_my_work['Store_ID'].isin(store_ids_over_300k)]

print(filtered_sales_df)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
1                2 2024-05-01 02:55:00       107         23       17
14              15 2024-05-02 17:01:00        27         44       15
18              19 2024-05-03 04:45:00       291          3       13
21              22 2024-05-03 13:32:00       106         15       15
28              29 2024-05-04 10:03:00       263         36        8
..             ...                 ...       ...        ...      ...
981            982 2024-08-28 19:14:00        39         23       15
989            990 2024-08-29 18:41:00       166         50       17
992            993 2024-08-30 03:29:00        81         18       13
995            996 2024-08-30 12:16:00       213         33       15
998            999 2024-08-30 21:04:00       127         11       15

     Quantity  Sales_Amount
1           1           600
14          1          3300
18          2          6500
21          4          9400
28          1          8600
..        ...           ...
981         1          3200
989         2          5100
992         3          7600
995         3          8400
998         3          4200

[253 rows x 7 columns]

In [64]:
# 解答例
sum_amount_per_storeid = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].sum().reset_index()
sum_amount_per_storeid.query("Sales_Amount > 300000")

   Store_ID  Sales_Amount
7         8        331600
12       13        343100
14       15        357500
16       17        326200

34. 会員ごとに取引回数をカウントしてください

In [65]:
# よくわからなかった
# sales_df_my_work.info()
# member_df.info()

sales_df_my_work.groupby('Member_ID')['Sales_Amount'].sum()
# sales_df_my_work['Member_ID'].unique()

Member_ID
1      10000
2      23600
3      20400
4       5200
5      18100
       ...
295    23500
296     9400
297    10900
298     9400
300    11800
Name: Sales_Amount, Length: 288, dtype: int64

In [66]:
# LLMが回答
transaction_count_per_member = sales_df_my_work.groupby('Member_ID').size()
print(transaction_count_per_member)

Member_ID
1      2
2      4
3      4
4      2
5      4
      ..
295    3
296    1
297    2
298    1
300    2
Length: 288, dtype: int64

In [67]:
# 解答例
# Member_IDごとにTransaction_IDをカウント
# sales_df_my_work.groupby("Member_ID")["Transaction_ID"].count()
sales_df_my_work.groupby('Member_ID')['Transaction_ID'].count().reset_index()

# sales_df_my_work['Transaction_ID'].count()

    Member_ID  Transaction_ID
0           1               2
1           2               4
2           3               4
3           4               2
4           5               4
..        ...             ...
283       295               3
284       296               1
285       297               2
286       298               1
287       300               2

[288 rows x 2 columns]

35. 会員ごとに取引回数をカウントし、2回以上の取引がある会員を抽出してください

In [68]:
# transaction_count_per_member.head()
transaction_count_per_member[transaction_count_per_member >= 2] # .nunique()

Member_ID
1      2
2      4
3      4
4      2
5      4
      ..
293    3
294    2
295    3
297    2
300    2
Length: 252, dtype: int64

In [69]:
# 解答例
member_transaction_count = sales_df_my_work.groupby('Member_ID')['Transaction_ID'].count().reset_index()
judge_num = 2 # 試しにクエリで変数を使うために定義
member_transaction_count.query("Transaction_ID >= @judge_num")

    Member_ID  Transaction_ID
0           1               2
1           2               4
2           3               4
3           4               2
4           5               4
..        ...             ...
281       293               3
282       294               2
283       295               3
285       297               2
287       300               2

[252 rows x 2 columns]

36. 年齢グループ（-30歳、31-50歳、51-65歳、66歳-）を作成し、各グループの会員数を集計してください。

In [70]:
# member_df.info()
# member_df['Age'].unique()
age_under_30 = member_df[member_df['Age'] <= 30]
age_31to50 = member_df[(member_df['Age'] >= 31) & (member_df['Age'] <= 50)]
age_over_66 = member_df[member_df['Age'] >= 66]

# member_df.groupby(['age_under_30', 'age_31to50', 'age_over_66'])[('Member_ID')].size()
print(age_under_30['Member_ID'].nunique(), age_31to50['Member_ID'].nunique(), age_over_66['Member_ID'].nunique())

49 103 89

In [71]:
# LLMが回答
age_under_30 = member_df[member_df['Age'] <= 30]
age_31to50 = member_df[(member_df['Age'] >= 31) & (member_df['Age'] <= 50)]
age_over_66 = member_df[member_df['Age'] >= 66]

# Concatenate the DataFrames
age_groups = pd.concat([age_under_30, age_31to50, age_over_66])

# Create a new column to categorize the age groups
age_groups['Age_Group'] = pd.cut(age_groups['Age'], bins=[0, 30, 50, 65, 100], labels=['-30歳', '31-50歳', '51-65歳', '66歳-'])

# Group by the new age group column and count the number of members in each group
age_group_counts = age_groups.groupby('Age_Group')['Member_ID'].size()
print(age_group_counts)

Age_Group
-30歳       49
31-50歳    103
51-65歳      0
66歳-       89
Name: Member_ID, dtype: int64

In [72]:
# 解答例
# 年齢の区切りを作成
# age_bins = [min(member_df['Age']), 30, 50, 65, max(member_df['Age'])]
age_bins = [min(member_df['Age'])-1, 30, 50, 65, max(member_df['Age'])]
# 各年代のラベル(名前)を作成
age_labels = ["-30", "31-50", "51-65", "66-"]
# 定義したbinsに沿ってデータを区切り、ラベルも付与してくれるcut関数を使用
# pd.cut(member_df['Age'], bins=age_bins, labels=age_labels) # 各サンプルがどのbinsに属するかを返す
member_df['Age_Group'] = pd.cut(member_df['Age'], bins=age_bins, labels=age_labels) # 新しいカラムに格納
member_df.groupby('Age_Group')['Member_ID'].count().reset_index() # Age_GroupごとにMember_IDをカウント

# Age_GroupにNaNが含まれる原因
# cut関数はbinsの値の+1の部分を見ている
# 例: min+1~, 30+1~, 50+1~, 65+1~
# なので、minのサンプルは含まれずにNaNになってしまうので、-1をする

  Age_Group  Member_ID
0       -30         49
1     31-50        103
2     51-65         59
3       66-         89

37. 会員になってからの日数（Days_Since_Registration）のグループ（〜1年、1年〜2年, 2年〜）を作成し、各グループの会員数を集計してください

In [73]:
# # Daysからyearにする方法がわからなかった
# member_df['Days_Since_Registration'].head() # .info()
# # pd.to_datetime(member_df['Registration_Date']) - pd.to_datetime('2024-08-01')

# # member_df['Days_Since_Registration'].describe()
# member_df[member_df['Days_Since_Registration'] == 1]

In [74]:
# # LLMが回答
# # Create bins for the days since registration
# bins = [0, 365, 710, float('inf')] # DataFrameの最小値を含まないように境界値を設定
# labels = ['〜1年', '1年〜2年', '2年〜']

# # Create a new column in member_df to categorize the days since registration
# member_df['Registration_Group'] = pd.cut(member_df['Days_Since_Registration'], bins=bins, labels=labels) # binsで指定した境界値でグループ化

# # Group by the new registration group column and count the number of members in each group
# registration_group_counts = member_df.groupby('Registration_Group')['Member_ID'].size() # グループごとにメンバー数をカウント
# registration_group_counts

# # nunique(), size()は結果が異なる。おそらく、nunique()は各Member_IDの種類なので、1とかになってしまう？
# # registration_group_counts = member_df.groupby('Registration_Group')['Member_ID'].nunique() # グループごとにユニークなメンバー数をカウント
# # registration_group_counts.reset_index()

In [75]:
# 解答例
year_bins = [min(member_df['Days_Since_Registration'])-1, 365, 710, max(member_df['Days_Since_Registration'])]
year_labels = ["-1年", "1年-2年", "2年-"]
member_df['Year_Group'] = pd.cut(member_df['Days_Since_Registration'], bins=year_bins, labels=year_labels) # 新しいカラムに格納
member_df.groupby('Year_Group')['Member_ID'].count().reset_index() # Year_GroupごとにMember_IDをカウント

  Year_Group  Member_ID
0        -1年         52
1      1年-2年         50
2        2年-        198

In [76]:
# Cut関数の動作確認
# Cut関数はList型で指定した境界値で区切る（以下のように1つの数字の場合は、分割数の指定になる）

# member_df['Registration_Group'].nunique() # value_counts()
ser = [11, 46, 65, 34, 25, 12, 35, 79]
# pd.cut(ser, 4) # 4分割する (17ずつに分ける)
pd.cut(ser, 4).value_counts()

# pd.DataFrame(ser, columns=['Age']).sum()/17 # mean()


# 年齢, どこの範囲に含まれるか
test_age_list = pd.DataFrame([], columns=['Age'])
test_age_list['Age'] = pd.Series([0,20,32,21,15,40,12,35,32,39,24,58,57,11,52,54,19])
test_split_age_list = pd.cut(test_age_list['Age'], bins=[-1,19,39,59]) # Cut関数は各サンプルをどの範囲に含むかを示すラベルを返す
test_age_list['Split_age'] = test_split_age_list
print(test_age_list)

    Age Split_age
0     0  (-1, 19]
1    20  (19, 39]
2    32  (19, 39]
3    21  (19, 39]
4    15  (-1, 19]
5    40  (39, 59]
6    12  (-1, 19]
7    35  (19, 39]
8    32  (19, 39]
9    39  (19, 39]
10   24  (19, 39]
11   58  (39, 59]
12   57  (39, 59]
13   11  (-1, 19]
14   52  (39, 59]
15   54  (39, 59]
16   19  (-1, 19]

38. 売上データと会員データを結合しmerged_dfとして定義してください

In [77]:
# pd.mergeとpd.concatは同じように見えるが、異なる動作をする。
# 今回の場合だと、Member_IDが重複してしまう。
# mergeは、onでどのデータをもとに結合するかを指定するので、重複しない。

# merged_df = pd.merge(sales_df_my_work, member_df, on='Member_ID', how='inner')
# merged_df.head()

merged_df = pd.concat([sales_df_my_work, member_df], axis=1)
merged_df.columns.value_counts()

Member_ID                  2
Transaction_ID             1
Transaction_Date           1
Product_ID                 1
Store_ID                   1
Quantity                   1
Sales_Amount               1
Gender                     1
Age                        1
Days_Since_Registration    1
Age_Group                  1
Year_Group                 1
Name: count, dtype: int64

In [78]:
# 解答例
# pd.mergeとpd.concatは同じように見えるが、異なる動作をする。
# 今回の場合だと、Member_IDが重複してしまう。
# mergeは、onでどのデータをもとに結合するかを指定するので、重複しない。
# 注意点：結合時に指定するデータ(on=)は、型が違うと同じデータととみなされないので注意
merged_df = pd.merge(sales_df_my_work, member_df, on='Member_ID')
merged_df # .columns.value_counts()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
0,1,2024-05-01 00:00:00,21,25,12,3,5800,Female,58,323,51-65,-1年
1,315,2024-06-08 08:18:00,21,41,15,3,1200,Female,58,323,51-65,-1年
2,602,2024-07-13 09:29:00,21,11,11,2,10000,Female,58,323,51-65,-1年
3,617,2024-07-15 05:27:00,21,5,5,3,5000,Female,58,323,51-65,-1年
4,730,2024-07-29 00:38:00,21,44,17,2,700,Female,58,323,51-65,-1年
...,...,...,...,...,...,...,...,...,...,...,...,...
995,894,2024-08-18 01:19:00,194,17,6,4,9600,Male,25,1030,-30,2年-
996,896,2024-08-18 07:10:00,257,48,14,2,1600,Female,76,1920,66-,2年-
997,929,2024-08-22 07:54:00,37,17,8,3,6700,Male,54,1032,51-65,2年-
998,942,2024-08-23 22:00:00,45,32,12,2,4900,Female,46,619,31-50,1年-2年
999,991,2024-08-29 21:37:00,296,16,14,2,9400,Male,41,1513,31-50,2年-

39. 性別 ごとに 平均Amount を計算してください

In [79]:
# merged_df.info()
merged_df.groupby('Gender')['Sales_Amount'].mean()

Gender
Female    5373.939394
Male      5302.970297
Name: Sales_Amount, dtype: float64

In [80]:
# 解答例
# 結合する前は、性別は会員データ、Amountは売り上げデータだったので、マージしたからこそ扱える操作になる
merged_df.groupby('Gender')['Sales_Amount'].mean().reset_index()

   Gender  Sales_Amount
0  Female   5373.939394
1    Male   5302.970297

40. 性別ごとの平均 Quantity を集計してください

In [81]:
merged_df.groupby('Gender')['Quantity'].mean()

Gender
Female    2.529293
Male      2.572277
Name: Quantity, dtype: float64

In [82]:
# 解答例
# 結合する前は、性別は会員データ、Quantityは売り上げデータだったので、マージしたからこそ扱える操作になる
merged_df.groupby('Gender')['Quantity'].mean().reset_index()

   Gender  Quantity
0  Female  2.529293
1    Male  2.572277

41. 性別と店舗IDごとに取引数を集計してください

In [83]:
# merged_df.info()
merged_df.columns
merged_df.groupby(['Gender', 'Store_ID'])['Transaction_ID'].count().reset_index()

    Gender Store_ID  Transaction_ID
0   Female        1              19
1   Female        2              19
2   Female        3              24
3   Female        4              29
4   Female        5              25
5   Female        6              28
6   Female        7              16
7   Female        8              34
8   Female        9              22
9   Female       10              19
10  Female       11              24
11  Female       12              27
12  Female       13              26
13  Female       14              27
14  Female       15              30
15  Female       16              24
16  Female       17              34
17  Female       18              22
18  Female       19              23
19  Female       20              23
20    Male        1              26
21    Male        2              23
22    Male        3              27
23    Male        4              12
24    Male        5              19
25    Male        6              26
26    Male        7              23
27    Male        8              27
28    Male        9              20
29    Male       10              33
30    Male       11              26
31    Male       12              17
32    Male       13              33
33    Male       14              18
34    Male       15              34
35    Male       16              27
36    Male       17              35
37    Male       18              26
38    Male       19              24
39    Male       20              29

42. Store_ID が [1, 5, 9] の取引を抽出し、Store_ID ごとに Quantity の合計を計算してください

In [84]:
# merged_df['Store_ID'].unique()
filtered_merged_df = merged_df.query("Store_ID in [1, 5, 9]")
filtered_merged_df.groupby('Store_ID')['Quantity'].sum().reset_index()

   Store_ID  Quantity
0         1       111
1         2         0
2         3         0
3         4         0
4         5       125
5         6         0
6         7         0
7         8         0
8         9       112
9        10         0
10       11         0
11       12         0
12       13         0
13       14         0
14       15         0
15       16         0
16       17         0
17       18         0
18       19         0
19       20         0

43. データセットの最後の10日間の取引を抽出し、Transaction_Date ごとにAmountを集計してください

In [85]:
merged_df_tail_10 = merged_df.tail(10)
merged_df_tail_10.groupby('Transaction_Date')['Sales_Amount'].sum().reset_index()

     Transaction_Date  Sales_Amount
0 2024-08-16 05:21:00          9500
1 2024-08-16 14:09:00          3900
2 2024-08-17 07:44:00          3400
3 2024-08-18 01:19:00          9600
4 2024-08-18 07:10:00          1600
5 2024-08-19 21:17:00          2100
6 2024-08-22 07:54:00          6700
7 2024-08-23 22:00:00          4900
8 2024-08-29 15:45:00          7700
9 2024-08-29 21:37:00          9400

44. 合計Amountが最も高い会員トップ5を特定してください

In [86]:
# LLMが回答
top_5_members = merged_df.groupby('Member_ID')['Sales_Amount'].sum().nlargest(5).reset_index()
top_5_members

   Member_ID  Sales_Amount
0         49         55200
1        260         55100
2        149         51300
3        154         51200
4        158         50200

In [87]:
# 自分で考えたがわからなかった
# merged_df.query('Sales_Amount')
merged_df['Sales_Amount'].max()

10000

45. 会員ごとに最も新しい取引を集計してください

In [88]:
# merged_df.groupby('Member_ID')['Transaction_Date'].idxmax().reset_index()
merged_df.groupby('Member_ID')['Transaction_Date'].max().reset_index()
# merged_df.info()

     Member_ID    Transaction_Date
0            1 2024-08-24 00:56:00
1            2 2024-08-29 12:49:00
2            3 2024-07-01 10:15:00
3            4 2024-08-05 11:26:00
4            5 2024-07-18 09:39:00
..         ...                 ...
283        295 2024-08-21 14:19:00
284        296 2024-08-29 21:37:00
285        297 2024-07-24 23:55:00
286        298 2024-05-05 06:34:00
287        300 2024-05-18 05:15:00

[288 rows x 2 columns]

In [89]:
# # 会員ごとに最も新しい取引を取得
# latest_transactions = merged_df.loc[merged_df.groupby('Member_ID')['Transaction_Date'].idxmax()]

# # 結果を表示
# latest_transactions

46. 会員ごとに最も古い取引を集計してください

In [90]:
merged_df.groupby('Member_ID')['Transaction_Date'].min().reset_index()

     Member_ID    Transaction_Date
0            1 2024-08-04 20:46:00
1            2 2024-05-03 22:20:00
2            3 2024-05-19 13:30:00
3            4 2024-07-01 01:27:00
4            5 2024-05-15 09:50:00
..         ...                 ...
283        295 2024-06-24 08:15:00
284        296 2024-08-29 21:37:00
285        297 2024-07-10 02:21:00
286        298 2024-05-05 06:34:00
287        300 2024-05-16 12:13:00

[288 rows x 2 columns]

47. 会員ごとに取引日時の最も古いデータと最も新しいデータを集計し、それぞれが違うレコードを抽出してください

In [91]:
member_old = merged_df.groupby('Member_ID')['Transaction_Date'].min().reset_index()
member_new = merged_df.groupby('Member_ID')['Transaction_Date'].max().reset_index()
# member_old.columns = ['Member_ID', 'Old_Date']
# member_old

member_old.query('@member_old == @member_new')

     Member_ID    Transaction_Date
0            1                 NaT
1            2                 NaT
2            3                 NaT
3            4                 NaT
4            5                 NaT
..         ...                 ...
283        295                 NaT
284        296 2024-08-29 21:37:00
285        297                 NaT
286        298 2024-05-05 06:34:00
287        300                 NaT

[288 rows x 2 columns]

48. Member_ID に「2」が含まれる会員の取引を抽出してください。

In [92]:
merged_df.query('Member_ID in [2]')

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
111,25,2024-05-03 22:20:00,2,40,20,2,6600,Female,18,958,-30,2年-
112,644,2024-07-18 12:35:00,2,29,3,2,8600,Female,18,958,-30,2年-
113,851,2024-08-12 19:17:00,2,20,4,4,2000,Female,18,958,-30,2年-
114,988,2024-08-29 12:49:00,2,14,18,4,6400,Female,18,958,-30,2年-

In [93]:
# filtered_transactions = merged_df[merged_df['Member_ID'].astype(str).str.contains('2')]
# print(filtered_transactions)

49. Product_ID が「1」で始まる取引を抽出してください。

In [94]:
merged_df.query('Product_ID in [1]')

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
44,775,2024-08-03 12:32:00,271,1,12,4,4400,Male,76,481,66-,1年-2年
128,39,2024-05-05 15:22:00,263,1,9,4,8600,Female,32,1809,31-50,2年-
130,255,2024-06-01 00:27:00,263,1,12,3,4300,Female,32,1809,31-50,2年-
146,514,2024-07-02 15:34:00,159,1,18,4,5200,Male,30,1657,-30,2年-
164,40,2024-05-05 18:18:00,172,1,17,2,7000,Male,48,590,31-50,1年-2年
220,63,2024-05-08 13:43:00,152,1,15,4,9600,Female,18,553,-30,1年-2年
378,821,2024-08-09 03:21:00,102,1,6,1,3300,Female,32,432,31-50,1年-2年
448,130,2024-05-16 18:05:00,259,1,1,2,9500,Female,56,1562,51-65,2年-
531,765,2024-08-02 07:13:00,180,1,9,1,6800,Male,70,1473,66-,2年-
535,763,2024-08-02 01:22:00,190,1,20,4,5200,Female,57,719,51-65,2年-
637,604,2024-07-13 15:21:00,178,1,18,3,3900,Male,80,86,66-,-1年
643,251,2024-05-31 12:43:00,99,1,8,1,6900,Female,29,1753,-30,2年-
664,263,2024-06-01 23:54:00,273,1,10,2,2900,Male,71,461,66-,1年-2年
669,313,2024-06-08 02:27:00,221,1,11,2,1700,Male,49,629,31-50,1年-2年
772,738,2024-07-30 00:05:00,247,1,18,4,3700,Female,55,1345,51-65,2年-
809,478,2024-06-28 06:03:00,223,1,3,2,2900,Male,70,409,66-,1年-2年
816,378,2024-06-16 00:57:00,255,1,5,2,3400,Female,40,298,31-50,-1年
914,903,2024-08-19 03:41:00,61,1,11,2,9800,Female,54,1879,51-65,2年-
922,697,2024-07-24 23:55:00,297,1,8,4,9200,Female,58,1613,51-65,2年-
931,963,2024-08-26 11:33:00,127,1,6,2,7000,Female,49,1134,31-50,2年-
941,915,2024-08-20 14:52:00,177,1,20,1,5700,Female,34,1397,31-50,2年-
970,935,2024-08-23 01:29:00,41,1,13,2,600,Male,52,1227,51-65,2年-

50. Store_ID が「5」で終わる取引を抽出してください

In [95]:
merged_df.query("Store_ID == 5")

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
3,617,2024-07-15 05:27:00,21,5,5,3,5000,Female,58,323,51-65,-1年
20,396,2024-06-18 05:43:00,124,17,5,1,1500,Male,73,1798,66-,2年-
24,5,2024-05-01 11:43:00,281,28,5,4,9400,Male,70,333,66-,-1年
32,7,2024-05-01 17:35:00,203,43,5,3,9800,Male,49,184,31-50,-1年
40,979,2024-08-28 10:27:00,51,31,5,3,4800,Male,72,1280,66-,2年-
61,13,2024-05-02 11:10:00,290,38,5,4,5000,Female,79,107,66-,-1年
73,253,2024-05-31 18:35:00,156,25,5,3,6900,Male,72,869,66-,2年-
100,198,2024-05-25 01:23:00,158,4,5,3,9200,Female,20,1023,-30,2年-
108,235,2024-05-29 13:50:00,146,24,5,2,6300,Male,80,527,66-,1年-2年
136,945,2024-08-24 06:47:00,108,49,5,3,8000,Female,30,1928,-30,2年-
147,34,2024-05-05 00:43:00,71,28,5,4,9600,Female,20,1034,-30,2年-
152,36,2024-05-05 06:34:00,298,7,5,3,9400,Female,71,1177,66-,2年-
190,900,2024-08-18 18:54:00,214,37,5,4,4200,Male,33,1390,31-50,2年-
239,614,2024-07-14 20:39:00,154,26,5,2,7000,Female,68,274,66-,-1年
368,495,2024-06-30 07:52:00,188,22,5,3,2400,Female,80,80,66-,-1年
380,168,2024-05-21 09:27:00,288,20,5,1,6500,Female,80,20,66-,-1年
411,304,2024-06-07 00:04:00,196,39,5,4,4600,Male,52,60,51-65,-1年
428,243,2024-05-30 13:17:00,5,8,5,3,3400,Male,69,269,66-,-1年
452,132,2024-05-16 23:57:00,215,24,5,2,5900,Male,58,1445,51-65,2年-
481,445,2024-06-24 05:20:00,30,18,5,4,1600,Male,51,334,51-65,-1年
491,803,2024-08-06 22:36:00,115,15,5,4,4500,Female,54,1016,51-65,2年-
523,178,2024-05-22 14:46:00,66,44,5,2,1600,Female,61,1167,51-65,2年-
537,919,2024-08-21 02:35:00,190,17,5,2,6100,Female,57,719,51-65,2年-
546,716,2024-07-27 07:36:00,101,43,5,3,9100,Female,23,1031,-30,2年-
571,587,2024-07-11 13:31:00,163,7,5,3,8900,Male,80,1917,66-,2年-
576,869,2024-08-15 00:02:00,276,48,5,4,3800,Male,26,771,-30,2年-
583,210,2024-05-26 12:33:00,266,32,5,3,6200,Male,56,1272,51-65,2年-
602,218,2024-05-27 12:00:00,110,46,5,2,3800,Female,80,577,66-,1年-2年
613,449,2024-06-24 17:03:00,128,31,5,4,9500,Female,72,1589,66-,2年-
630,921,2024-08-21 08:27:00,43,41,5,2,4300,Female,30,919,-30,2年-
642,824,2024-08-09 12:09:00,83,24,5,4,3500,Male,65,549,51-65,1年-2年
694,746,2024-07-30 23:32:00,133,20,5,3,6800,Male,44,396,31-50,1年-2年
698,527,2024-07-04 05:40:00,183,41,5,2,8100,Male,80,1961,66-,2年-
721,385,2024-06-16 21:28:00,181,4,5,4,800,Female,18,1844,-30,2年-
800,983,2024-08-28 22:10:00,28,2,5,2,2000,Female,40,1572,31-50,2年-
816,378,2024-06-16 00:57:00,255,1,5,2,3400,Female,40,298,31-50,-1年
867,439,2024-06-23 11:44:00,184,35,5,1,6000,Male,74,1452,66-,2年-
885,510,2024-07-02 03:50:00,24,25,5,4,5100,Female,26,1407,-30,2年-
891,511,2024-07-02 06:46:00,162,36,5,4,8200,Male,72,1,66-,-1年
913,632,2024-07-17 01:25:00,61,38,5,3,9600,Female,54,1879,51-65,2年-
915,559,2024-07-08 03:27:00,245,29,5,3,1200,Female,60,1565,51-65,2年-
916,924,2024-08-21 17:14:00,245,13,5,2,9900,Female,60,1565,51-65,2年-
943,639,2024-07-17 21:56:00,98,31,5,2,3900,Female,30,1136,-30,2年-
953,690,2024-07-24 03:24:00,89,42,5,1,3400,Female,26,1135,-30,2年-

51. Transaction_ID が奇数の取引を抽出してください

In [96]:
# merged_df.query('Transaction_ID %2 == 1')
kisuu = merged_df[merged_df['Transaction_ID'].astype(int) %2 == 1]
# kisuu = merged_df[merged_df['Transaction_ID']==1]
kisuu

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
0,1,2024-05-01 00:00:00,21,25,12,3,5800,Female,58,323,51-65,-1年
1,315,2024-06-08 08:18:00,21,41,15,3,1200,Female,58,323,51-65,-1年
3,617,2024-07-15 05:27:00,21,5,5,3,5000,Female,58,323,51-65,-1年
5,795,2024-08-05 23:09:00,21,40,7,1,1100,Female,58,323,51-65,-1年
8,553,2024-07-07 09:52:00,107,8,20,4,9900,Male,71,1665,66-,2年-
...,...,...,...,...,...,...,...,...,...,...,...,...
990,879,2024-08-16 05:21:00,15,21,2,1,9500,Female,47,1450,31-50,2年-
992,909,2024-08-19 21:17:00,93,2,3,4,2100,Female,46,815,31-50,2年-
993,989,2024-08-29 15:45:00,93,3,4,3,7700,Female,46,815,31-50,2年-
997,929,2024-08-22 07:54:00,37,17,8,3,6700,Male,54,1032,51-65,2年-
999,991,2024-08-29 21:37:00,296,16,14,2,9400,Male,41,1513,31-50,2年-

In [97]:
# merged_df.query('Transaction_ID % 2 == 1')

52. Member_ID が3桁の会員の取引を抽出してください

In [98]:
merged_df[merged_df['Member_ID'] >= 100]

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
7,2,2024-05-01 02:55:00,107,23,17,1,600,Male,71,1665,66-,2年-
8,553,2024-07-07 09:52:00,107,8,20,4,9900,Male,71,1665,66-,2年-
9,599,2024-07-13 00:41:00,107,47,10,4,9000,Male,71,1665,66-,2年-
10,718,2024-07-27 13:28:00,107,24,9,2,6900,Male,71,1665,66-,2年-
11,3,2024-05-01 05:51:00,117,24,6,3,1300,Male,56,751,51-65,2年-
...,...,...,...,...,...,...,...,...,...,...,...,...
988,965,2024-08-26 17:25:00,147,27,16,3,7400,Male,58,649,51-65,1年-2年
994,888,2024-08-17 07:44:00,179,9,3,3,3400,Male,63,1988,51-65,2年-
995,894,2024-08-18 01:19:00,194,17,6,4,9600,Male,25,1030,-30,2年-
996,896,2024-08-18 07:10:00,257,48,14,2,1600,Female,76,1920,66-,2年-
999,991,2024-08-29 21:37:00,296,16,14,2,9400,Male,41,1513,31-50,2年-

53. Member_ID に「1」と「3」が連続して含まれる取引を抽出してください

In [99]:
# merged_df['Member_ID']

In [100]:
# LLMの回答
filtered_transactions = merged_df[merged_df['Member_ID'].astype(str).str.contains('13')]
print(filtered_transactions)

    Transaction_ID    Transaction_Date  Member_ID Product_ID Store_ID  \
81              20 2024-05-03 07:41:00        136         28       20
82             113 2024-05-14 16:15:00        136         45       15
83             152 2024-05-19 10:34:00        136         17        3
84             368 2024-06-14 19:39:00        136         24       11
85             452 2024-06-25 01:50:00        136          9       16
86             908 2024-08-19 18:21:00        136         24       18
87             920 2024-08-21 05:31:00        136         34       13
117             27 2024-05-04 04:12:00        132         48       10
118            483 2024-06-28 20:42:00        132         13       16
119            485 2024-06-29 02:34:00        132         10        6
120            889 2024-08-17 10:40:00        132         17       20
335             85 2024-05-11 06:11:00        138         30        2
336            288 2024-06-05 01:10:00        138         38        1
337            363 2024-06-14 04:59:00        138         32        8
338            550 2024-07-07 01:04:00        138         33       15
339            657 2024-07-20 02:41:00        138         31       12
420            118 2024-05-15 06:55:00        130         34       11
421            131 2024-05-16 21:01:00        130         28       14
422            206 2024-05-26 00:50:00        130         17       20
423            239 2024-05-30 01:33:00        130         47       16
424            245 2024-05-30 19:08:00        130         49       14
425            323 2024-06-09 07:45:00        130         31       12
560            199 2024-05-25 04:19:00        134          7       17
561            750 2024-07-31 11:16:00        134         49       18
562            805 2024-08-07 04:28:00        134         45       19
692            280 2024-06-04 01:43:00        133          3        1
693            351 2024-06-12 17:49:00        133         18       13
694            746 2024-07-30 23:32:00        133         20        5
710            290 2024-06-05 07:02:00         13          2        2
711            466 2024-06-26 18:52:00         13          8       16
712            291 2024-06-05 09:58:00        213         40       19
713            293 2024-06-05 15:49:00        213         34        1
714            399 2024-06-18 14:30:00        213         29       10
715            430 2024-06-22 09:22:00        213         48        4
716            584 2024-07-11 04:43:00        213         17        3
717            670 2024-07-21 16:47:00        213         25       18
718            753 2024-07-31 20:03:00        213         26       13
719            996 2024-08-30 12:16:00        213         33       15
737            317 2024-06-08 14:10:00        113         13       16
738            403 2024-06-19 02:14:00        113         10        8
739            528 2024-07-04 08:36:00        113         34        9
740            532 2024-07-04 20:19:00        113         32        1
741            554 2024-07-07 12:48:00        113         45        6
742            968 2024-08-27 02:12:00        113         40        6
791            356 2024-06-13 08:28:00        139         49       15
792            774 2024-08-03 09:36:00        139          5        1
845            416 2024-06-20 16:20:00        135          4       18
909            547 2024-07-06 16:17:00        137         32       16
910            724 2024-07-28 07:03:00        137         27       10
935            620 2024-07-15 14:14:00        131         11        8
936            742 2024-07-30 11:49:00        131          7        8
937            756 2024-08-01 04:51:00        131         18       18

     Quantity  Sales_Amount  Gender  Age  Days_Since_Registration Age_Group  \
81          1          7600    Male   41                     1858     31-50
82          3          7900    Male   41                     1858     31-50
83          1          8200    Male   41                     1858     31-50
84          4          1500    Male   41                     1858     31-50
85          4          8200    Male   41                     1858     31-50
86          2           600    Male   41                     1858     31-50
87          3          1900    Male   41                     1858     31-50
117         4          3300  Female   50                     1331     31-50
118         2          3600  Female   50                     1331     31-50
119         2          7400  Female   50                     1331     31-50
120         3          9300  Female   50                     1331     31-50
335         3          1800    Male   33                     1107     31-50
336         2          8200    Male   33                     1107     31-50
337         4          9900    Male   33                     1107     31-50
338         4          7700    Male   33                     1107     31-50
339         4          9600    Male   33                     1107     31-50
420         1           600  Female   41                      254     31-50
421         3          5100  Female   41                      254     31-50
422         2          9000  Female   41                      254     31-50
423         3          3000  Female   41                      254     31-50
424         3          9900  Female   41                      254     31-50
425         4          3900  Female   41                      254     31-50
560         1          8900    Male   40                      346     31-50
561         1          3900    Male   40                      346     31-50
562         3          7000    Male   40                      346     31-50
692         4          8200    Male   44                      396     31-50
693         2          6400    Male   44                      396     31-50
694         3          6800    Male   44                      396     31-50
710         3          5000    Male   41                     1855     31-50
711         2          3800    Male   41                     1855     31-50
712         1          7200  Female   64                      698     51-65
713         1          1600  Female   64                      698     51-65
714         1          8800  Female   64                      698     51-65
715         1          3700  Female   64                      698     51-65
716         1          1700  Female   64                      698     51-65
717         1           500  Female   64                      698     51-65
718         2          8900  Female   64                      698     51-65
719         3          8400  Female   64                      698     51-65
737         2          3200  Female   36                      111     31-50
738         3          5100  Female   36                      111     31-50
739         4          1700  Female   36                      111     31-50
740         4          4800  Female   36                      111     31-50
741         3          6600  Female   36                      111     31-50
742         4          6400  Female   36                      111     31-50
791         2          5100    Male   49                      162     31-50
792         3          4200    Male   49                      162     31-50
845         2          6800    Male   71                     1964       66-
909         2          6100  Female   61                     1501     51-65
910         2          1600  Female   61                     1501     51-65
935         1          5200    Male   34                     1003     31-50
936         2          8800    Male   34                     1003     31-50
937         3          1000    Male   34                     1003     31-50

    Year_Group
81         2年-
82         2年-
83         2年-
84         2年-
85         2年-
86         2年-
87         2年-
117        2年-
118        2年-
119        2年-
120        2年-
335        2年-
336        2年-
337        2年-
338        2年-
339        2年-
420        -1年
421        -1年
422        -1年
423        -1年
424        -1年
425        -1年
560        -1年
561        -1年
562        -1年
692      1年-2年
693      1年-2年
694      1年-2年
710        2年-
711        2年-
712      1年-2年
713      1年-2年
714      1年-2年
715      1年-2年
716      1年-2年
717      1年-2年
718      1年-2年
719      1年-2年
737        -1年
738        -1年
739        -1年
740        -1年
741        -1年
742        -1年
791        -1年
792        -1年
845        2年-
909        2年-
910        2年-
935        2年-
936        2年-
937        2年-

54. Member_ID が「1」で始まり、任意の数字が続く会員の取引を抽出してください

In [101]:
# merged_df['Member_ID'].sample(10)
# merged_df['Member_ID']

In [102]:
# LLMの回答
filtered_transactions = merged_df[merged_df['Member_ID'].astype(str).str.startswith('1')]
print(filtered_transactions)

    Transaction_ID    Transaction_Date  Member_ID Product_ID Store_ID  \
7                2 2024-05-01 02:55:00        107         23       17
8              553 2024-07-07 09:52:00        107          8       20
9              599 2024-07-13 00:41:00        107         47       10
10             718 2024-07-27 13:28:00        107         24        9
11               3 2024-05-01 05:51:00        117         24        6
..             ...                 ...        ...        ...      ...
987            939 2024-08-23 13:12:00        147         15       15
988            965 2024-08-26 17:25:00        147         27       16
990            879 2024-08-16 05:21:00         15         21        2
994            888 2024-08-17 07:44:00        179          9        3
995            894 2024-08-18 01:19:00        194         17        6

     Quantity  Sales_Amount  Gender  Age  Days_Since_Registration Age_Group  \
7           1           600    Male   71                     1665       66-
8           4          9900    Male   71                     1665       66-
9           4          9000    Male   71                     1665       66-
10          2          6900    Male   71                     1665       66-
11          3          1300    Male   56                      751     51-65
..        ...           ...     ...  ...                      ...       ...
987         2          1100    Male   58                      649     51-65
988         3          7400    Male   58                      649     51-65
990         1          9500  Female   47                     1450     31-50
994         3          3400    Male   63                     1988     51-65
995         4          9600    Male   25                     1030       -30

    Year_Group
7          2年-
8          2年-
9          2年-
10         2年-
11         2年-
..         ...
987      1年-2年
988      1年-2年
990        2年-
994        2年-
995        2年-

[397 rows x 12 columns]

55. Product_IDごとの Quantityの最頻値を集計し、最頻値が3以上の商品を抽出してください

In [103]:
filtered_merged_df = merged_df.groupby('Product_ID')['Quantity'].median().reset_index()
# reset_index()をしないと、Product_IDがindexになってしまい、Series型になってしまう

filtered_merged_df.query('Quantity >= 3')

   Product_ID  Quantity
2           3       3.0
4           5       3.0
5           6       3.0
8           9       3.0
9          10       3.0
10         11       3.0
11         12       3.0
13         14       3.0
15         16       3.0
17         18       3.0
19         20       3.0
21         22       3.0
24         25       3.0
27         28       3.0
28         29       3.0
29         30       3.0
30         31       3.0
31         32       3.0
32         33       3.0
33         34       3.0
34         35       3.0
35         36       3.0
36         37       3.0
37         38       3.0
38         39       3.0
41         42       3.0
44         45       3.0
48         49       3.0

56. Product_IDごとのQuantityの最頻値を計算し、最頻値が最大の商品を抽出してください

In [104]:
# LLMの回答
# merged_df.groupby('Product_ID')['Quantity'].median().reset_index().query('Quantity >= 3')
median_quantity = merged_df.groupby('Product_ID')['Quantity'].median().reset_index()
max_quantity = median_quantity['Quantity'].max()
median_quantity.query('Quantity == @max_quantity')

   Product_ID  Quantity
2           3       3.0
4           5       3.0
5           6       3.0
8           9       3.0
9          10       3.0
10         11       3.0
11         12       3.0
13         14       3.0
15         16       3.0
17         18       3.0
19         20       3.0
21         22       3.0
24         25       3.0
27         28       3.0
28         29       3.0
29         30       3.0
30         31       3.0
31         32       3.0
32         33       3.0
33         34       3.0
34         35       3.0
35         36       3.0
36         37       3.0
37         38       3.0
38         39       3.0
41         42       3.0
44         45       3.0
48         49       3.0

57. Store_ID ごとにAmountの分散を計算し、分散が大きい順にソートしてください

In [105]:
# # Select only numeric columns
# numeric_cols = merged_df.select_dtypes(include=['number'])

# # Compute the correlation matrix
# corr_df = numeric_cols.corr()
# corr_df
# # merged_df.info()

std_amount = merged_df.groupby('Store_ID')['Sales_Amount'].std().reset_index()
std_amount.sort_values(by='Sales_Amount', ascending=False)

   Store_ID  Sales_Amount
10       11   3002.613827
6         7   2952.493857
12       13   2926.384939
16       17   2899.081196
17       18   2851.426637
7         8   2851.083583
18       19   2841.450165
9        10   2835.039190
13       14   2829.583972
8         9   2806.980679
3         4   2791.795471
5         6   2774.439713
19       20   2763.407601
4         5   2745.786701
1         2   2743.639038
2         3   2673.936659
15       16   2641.324683
11       12   2582.813378
0         1   2533.718073
14       15   2512.310464

58. Member_ID ごとにAmountの標準偏差を計算し、標準偏差が4000以上の会員を抽出してください

In [106]:
merged_df.groupby('Member_ID')['Sales_Amount'].std().reset_index().query('Sales_Amount >= 4000')

     Member_ID  Sales_Amount
20          22   4171.930009
23          25   4333.589736
27          29   4666.904756
67          71   5586.143571
72          76   4042.647647
88          92   4107.310556
102        107   4192.851059
109        114   4590.206967
112        117   4092.443676
123        129   4086.318637
175        181   4525.483400
179        186   4703.544763
188        198   4146.785904
195        206   4525.483400
198        209   4737.615434
213        224   5232.590181
217        228   4389.001405
224        235   5232.590181
234        245   6151.828996
235        246   5232.590181
274        286   4051.748594
280        292   4005.413004
285        297   5303.300859

59. 会員データにおいて年齢ごとに会員数を集計し、会員数が多い順にソートしてください

In [107]:
merged_df.groupby('Age')['Member_ID'].count().reset_index().sort_values(by='Member_ID', ascending=False)

    Age  Member_ID
62   80         54
12   30         38
53   71         30
29   47         30
55   73         29
..  ...        ...
3    21          5
7    25          5
4    22          4
20   38          3
59   77          2

[63 rows x 2 columns]

60. 会員データの年齢の中央値を計算し、それより上の会員を抽出してください

In [108]:
# age_median = merged_df.groupby('Member_ID')['Age'].median().reset_index()
# age_median.query('Age > @age_median["Age"].median()')

age_median = merged_df['Age'].median()
merged_df.query('Age > @age_median')

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group
0,1,2024-05-01 00:00:00,21,25,12,3,5800,Female,58,323,51-65,-1年
1,315,2024-06-08 08:18:00,21,41,15,3,1200,Female,58,323,51-65,-1年
2,602,2024-07-13 09:29:00,21,11,11,2,10000,Female,58,323,51-65,-1年
3,617,2024-07-15 05:27:00,21,5,5,3,5000,Female,58,323,51-65,-1年
4,730,2024-07-29 00:38:00,21,44,17,2,700,Female,58,323,51-65,-1年
...,...,...,...,...,...,...,...,...,...,...,...,...
988,965,2024-08-26 17:25:00,147,27,16,3,7400,Male,58,649,51-65,1年-2年
989,865,2024-08-14 12:19:00,64,50,8,1,9900,Male,76,1188,66-,2年-
994,888,2024-08-17 07:44:00,179,9,3,3,3400,Male,63,1988,51-65,2年-
996,896,2024-08-18 07:10:00,257,48,14,2,1600,Female,76,1920,66-,2年-
997,929,2024-08-22 07:54:00,37,17,8,3,6700,Male,54,1032,51-65,2年-

61. Amountの大きいものから順番にランクを付与した上で昇順で並び替えてください。また同じAmountの場合は先に出現したものに高いランクを付与してください。

In [109]:
merged_df['Sales_Amount'].sort_values(ascending=False).reset_index()

     index  Sales_Amount
0      441         10000
1      161         10000
2        2         10000
3      895         10000
4      529         10000
..     ...           ...
995    211           500
996    954           500
997    849           500
998    717           500
999    456           500

[1000 rows x 2 columns]

In [110]:
# LLMの回答
# Assign ranks to the Sales_Amount column, with the largest amount getting rank 1
merged_df['Rank'] = merged_df['Sales_Amount'].rank(method='first', ascending=False)
# Sort the DataFrame by the assigned ranks in ascending order
sorted_df = merged_df.sort_values(by='Rank')
# Display the sorted DataFrame
sorted_df

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount,Gender,Age,Days_Since_Registration,Age_Group,Year_Group,Rank
2,602,2024-07-13 09:29:00,21,11,11,2,10000,Female,58,323,51-65,-1年,1.0
161,817,2024-08-08 15:38:00,84,4,7,2,10000,Male,67,934,66-,2年-,2.0
441,200,2024-05-25 07:15:00,67,45,10,4,10000,Female,66,1901,66-,2年-,3.0
529,180,2024-05-22 20:38:00,249,6,18,3,10000,Female,42,1633,31-50,2年-,4.0
625,497,2024-06-30 13:44:00,20,36,19,4,10000,Male,76,978,66-,2年-,5.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
258,443,2024-06-23 23:28:00,19,41,8,2,500,Female,71,386,66-,1年-2年,996.0
456,472,2024-06-27 12:28:00,209,6,13,1,500,Female,41,262,31-50,-1年,997.0
717,670,2024-07-21 16:47:00,213,25,18,1,500,Female,64,698,51-65,1年-2年,998.0
849,424,2024-06-21 15:47:00,235,19,6,2,500,Male,74,1490,66-,2年-,999.0
954,842,2024-08-11 16:54:00,89,41,10,1,500,Female,26,1135,-30,2年-,1000.0

62. Member_ID ごとの合計Amountに対して、パーセンタイル値を計算して低い順に並び替えてください

In [111]:
# merged_df.drop('Member_ID', axis=1).info() # defaultでaxis=0(行)なので、列を削除する場合はaxis=1を指定する
# merged_df.info()

# LLMの回答(Sales_Amountに対してpct_changeを行うことを忘れていた)
merged_df.groupby('Member_ID')['Sales_Amount'].sum().reset_index()['Sales_Amount'].pct_change().abs().sort_values(ascending=False)

# merged_df['Member_ID']

140    25.384615
247    20.687500
202    19.400000
88     12.750000
271    11.529412
         ...
63      0.033742
235     0.027027
57      0.025568
49      0.005587
0            NaN
Name: Sales_Amount, Length: 288, dtype: float64

In [112]:
# 重複したMember_IDを削除
merged_df = merged_df.loc[:, ~merged_df.columns.duplicated()]
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Transaction_ID           1000 non-null   category
 1   Transaction_Date         1000 non-null   datetime64[ns]
 2   Member_ID                1000 non-null   int64
 3   Product_ID               1000 non-null   category
 4   Store_ID                 1000 non-null   category
 5   Quantity                 1000 non-null   int64
 6   Sales_Amount             1000 non-null   int64
 7   Gender                   1000 non-null   object
 8   Age                      1000 non-null   int64
 9   Days_Since_Registration  1000 non-null   int64
 10  Age_Group                1000 non-null   category
 11  Year_Group               1000 non-null   category
 12  Rank                     1000 non-null   float64
dtypes: category(5), datetime64[ns](1), float64(1), int64(5), object(1)
memory usage: 112.1+ KB

In [113]:
import pandas as pd

# サンプルデータフレームを作成
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'A': [7, 8, 9]  # 重複した列
}
data['AA'] = [0, 0, 0] # pd.DataFrame({'A':[0, 0, 0]})
df = pd.DataFrame(data)

# 重複した列を削除
# df.loc[:, ~df.columns.duplicated()] # [行指定:列指定] ... [行すべて:列の重複していない列を取得]

# df.loc[:,df.columns[0]:df.columns[2]]
# ~df.columns.duplicated() # 重複していない列をTrueで返す

63. 年代を縦（行）、性別を横（列）に持つテーブルで、各セグメントごとの平均取引金額を集計してください

In [114]:
# LLMの回答
# Create a pivot table with Age_Group as rows and Gender as columns
pivot_table = merged_df.pivot_table(values='Sales_Amount', index='Age_Group', columns='Gender', aggfunc='mean')

# Display the pivot table
# print(pivot_table)
pivot_table

Gender          Female         Male
Age_Group
-30        5243.157895  6132.727273
31-50      5646.892655  5355.882353
51-65      5065.686275  4739.175258
66-        5337.190083  5303.278689

64. 前の課題のテーブルを、年代と性別が縦に並ぶように変換してください

In [122]:
# LLMの回答
# Melt the pivot table to have Age_Group and Gender as rows
melted_table = pivot_table.reset_index().melt(id_vars='Age_Group', var_name='Gender', value_name='Average_Sales_Amount')

# Display the melted table
# print(melted_table)
melted_table

  Age_Group  Gender  Average_Sales_Amount
0       -30  Female           5243.157895
1     31-50  Female           5646.892655
2     51-65  Female           5065.686275
3       66-  Female           5337.190083
4       -30    Male           6132.727273
5     31-50    Male           5355.882353
6     51-65    Male           4739.175258
7       66-    Male           5303.278689

65. 年代✕性別のごとの取引回数を集計し表示してください

In [123]:
# LLMの回答
# Group by Age_Group and Gender, and count the number of transactions
transaction_count = merged_df.groupby(['Age_Group', 'Gender'])['Transaction_ID'].count().reset_index()

# Display the result
# print(transaction_count)
transaction_count

  Age_Group  Gender  Transaction_ID
0       -30  Female              95
1       -30    Male              55
2     31-50  Female             177
3     31-50    Male             170
4     51-65  Female             102
5     51-65    Male              97
6       66-  Female             121
7       66-    Male             183

66. Amount が2000円以上なら 1、それ未満なら 0 を割り振ったフラグを新しいカラムに追加してください

67. Quantity の平均値以上の取引に 1、それ未満に 0 のフラグを追加してください

68. 顧客ごとの合計Amountに基づいて、〜25%点、〜50%点、〜75%点、〜100%点ごとに4つのカテゴリに分け、そのカテゴリを新しいカラムとして追加してください

69. Quantityが小さい順に等しく3つのカテゴリに分け、そのカテゴリを新しいカラムに追加してください

70. Gender カラムをダミー変数化してください

71. Amount カラムを標準化して新しいカラムを追加してください

72. 取引データ全体のうち10%をランダムにサンプリングしてください

73. 会員データの20%をランダムにサンプリングしてください

74. Amount が5000円以上の取引からランダムに5件をサンプリングしてください

75. Gender を層化基準にして取引データから20%抽出してください

76. Amount の平均から1σ以上離れた取引を外れ値として抽出してください（本来は3σ）

77. 現在のmember_dfをCSVファイルとして出力をしてください

78. seaborn を使って、merged_dfの数値カラム間の相関行列をヒートマップで可視化してください

79. plotlyを使って、merged_dfの数値カラム間の相関行列をヒートマップで可視化してください

80. matplotlib を使って、月ごとの合計Amountを棒グラフで表示してください

81. seaborn を使って、Store_ID ごとの取引数をカウントプロットで可視化してください

82. seaborn を使って、Store_ID ごとの合計Amountを棒グラフで表示してください

83. Plotlyを使って会員ごとの取引数を可視化してください

84. matplotlib を使って、日ごとの売上金額を折れ線グラフで表示してください

85. seaborn を使って、Amount の分布を箱ひげ図で表示してください

86. Days_Since_Registration に基づく顧客の分布を plotly の箱ひげ図で可視化してください

87. matplotlib を使って、Amount と Days_Since_Registration の関係を散布図で表示してください

88. plotly を使って、Days_Since_Registration と Amount の関係を散布図で表示してください。Store_IDごとに色を変えてください

89. seaborn の pairplot を使って、merged_dataの数値カラムの相関をペアプロットで可視化してください

90. plotly を使って、Product_ID ごとの売上と販売数量をバブルチャートで表示してください。Product_IDがX軸でAmountがY軸、そしてQuantityがバブルの大きさになるようにしてください

91. Amount カラムの分布をカーネル密度推定プロットで可視化してください

92. seaborn の regplot を使って、Amount と Days_Since_Registration の散布図に回帰直線を追加して可視化してください

93. seaborn の jointplot を使って、Amount と Days_Since_Registration の相関をヒストグラムと散布図を組み合わせた形で可視化してください

94. seaborn の violinplot を使って、Store_IDが1,3,5 の Quantity の分布を Violinプロットで可視化してください

95. matplotlib を使って、店舗ごとの売上合計をエリアチャートで可視化してください

96. matplotlib を使って、Store_ID ごとの売上を円グラフ（パイチャート）で可視化してください

97. Store_ID ごとの売上合計を plotly の円グラフ（パイチャート）で可視化してください

98. 取引日 ごとの売上累積を plotly のエリアチャートで可視化してください

99. Amount の分布を plotly のヒストグラムで可視化してください

100. Age と Days_Since_Registration の関係を散布図で可視化し、色分けを性別（Gender）に基づいて行ってください